import React from "react";
import styled from "styled-components";

export default function About() {
  return (
    <Container>
      나 그대를 언제부터 어떻게
      <br />
      좋아했는지 몰라요
      <br />
      눈 감아도 떠오르는 그대
      <br />
      날 어쩌면 좋을까요
      <br />
      몇 번을 잘 못했던 사랑에
      <br />
      두려워진 마음이
      <br />
      아직까지 바라만 보고 있으라 해요
      <br />
      날 사랑한다 말하던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br />
      항상 잃어왔던 누군가를
      <br />
      또 만들진 않을까
      <br />
      아직까지 바라만 볼 수밖에 없는데
      <br />
      널 사랑한다 말했던 나의 눈이
      <br />
      닿지 않으면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나서
      <br />
      그대 멀어지면 어쩌죠
      <br />
      난 괜찮아요 다 괜찮아요
      <br />
      나 이대로 있을게요
      <br />
      날 사랑한다 말했던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br /> 나 그대를 언제부터 어떻게
      <br />
      좋아했는지 몰라요
      <br />
      눈 감아도 떠오르는 그대
      <br />
      날 어쩌면 좋을까요
      <br />
      몇 번을 잘 못했던 사랑에
      <br />
      두려워진 마음이
      <br />
      아직까지 바라만 보고 있으라 해요
      <br />
      날 사랑한다 말하던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br />
      항상 잃어왔던 누군가를
      <br />
      또 만들진 않을까
      <br />
      아직까지 바라만 볼 수밖에 없는데
      <br />
      널 사랑한다 말했던 나의 눈이
      <br />
      닿지 않으면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나서
      <br />
      그대 멀어지면 어쩌죠
      <br />
      난 괜찮아요 다 괜찮아요
      <br />
      나 이대로 있을게요
      <br />
      날 사랑한다 말했던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br /> 나 그대를 언제부터 어떻게
      <br />
      좋아했는지 몰라요
      <br />
      눈 감아도 떠오르는 그대
      <br />
      날 어쩌면 좋을까요
      <br />
      몇 번을 잘 못했던 사랑에
      <br />
      두려워진 마음이
      <br />
      아직까지 바라만 보고 있으라 해요
      <br />
      날 사랑한다 말하던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br />
      항상 잃어왔던 누군가를
      <br />
      또 만들진 않을까
      <br />
      아직까지 바라만 볼 수밖에 없는데
      <br />
      널 사랑한다 말했던 나의 눈이
      <br />
      닿지 않으면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나서
      <br />
      그대 멀어지면 어쩌죠
      <br />
      난 괜찮아요 다 괜찮아요
      <br />
      나 이대로 있을게요
      <br />
      날 사랑한다 말했던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br /> 나 그대를 언제부터 어떻게
      <br />
      좋아했는지 몰라요
      <br />
      눈 감아도 떠오르는 그대
      <br />
      날 어쩌면 좋을까요
      <br />
      몇 번을 잘 못했던 사랑에
      <br />
      두려워진 마음이
      <br />
      아직까지 바라만 보고 있으라 해요
      <br />
      날 사랑한다 말하던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br />
      항상 잃어왔던 누군가를
      <br />
      또 만들진 않을까
      <br />
      아직까지 바라만 볼 수밖에 없는데
      <br />
      널 사랑한다 말했던 나의 눈이
      <br />
      닿지 않으면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나서
      <br />
      그대 멀어지면 어쩌죠
      <br />
      난 괜찮아요 다 괜찮아요
      <br />
      나 이대로 있을게요
      <br />
      날 사랑한다 말했던 그대 눈이
      <br />
      내 착각이면 어쩌죠
      <br />
      여전히 말 못 하는 나라서
      <br />
      언젠가 내 표정에 나타나면
      <br />
      그때 어쩌면 좋을까요
      <br />
    </Container>
  );
}

const Container = styled.div`
  display: flex;
  justify-content: center;
  text-align: center;
  margin-top: 42rem;
  padding: 3.5rem 0 6rem 0;
  width: 100%;
  @media (max-width: 768px) {
    margin-top: 26rem;
    padding: 3rem 0 4rem 0;
  }
`;
